<?php /** @noinspection NonAsciiCharacters */

namespace SunmKing\Amap\tools;

class WeatherCode
{
    private static $weather = ['00' => '晴', '01' => '少云', '02' => '晴间多云', '03' => '多云', '04' => '阴', '05' => '有风', '06' => '平静', '07' => '微风', '08' => '和风', '09' => '清风', '10' => '强风/劲风', '11' => '疾风', '12' => '大风', '13' => '烈风', '14' => '风暴', '15' => '狂爆风', '16' => '飓风', '17' => '热带风暴', '18' => '霾', '19' => '中度霾', '20' => '重度霾', '21' => '严重霾', '22' => '阵雨', '23' => '雷阵雨', '24' => '雷阵雨并伴有冰雹', '25' => '小雨', '26' => '中雨', '27' => '大雨', '28' => '暴雨', '29' => '大暴雨', '30' => '特大暴雨', '31' => '强阵雨', '32' => '强雷阵雨', '33' => '极端降雨', '34' => '毛毛雨/细雨', '35' => '雨', '36' => '小雨-中雨', '37' => '中雨-大雨', '38' => '大雨-暴雨', '39' => '暴雨-大暴雨', '40' => '大暴雨-特大暴雨', '41' => '雨夹雪', '42' => '阵雨夹雪', '43' => '冻雨', '44' => '雪', '45' => '阵雪', '46' => '小雪', '47' => '中雪', '48' => '大雪', '49' => '暴雪', '50' => '小雪-中雪', '51' => '中雪-大雪', '52' => '大雪-暴雪', '53' => '浮尘', '54' => '扬沙', '55' => '沙尘暴', '56' => '强沙尘暴', '57' => '龙卷风', '58' => '雾', '59' => '浓雾', '60' => '强浓雾', '61' => '轻雾', '62' => '大雾', '63' => '特强浓雾', '64' => '热', '65' => '冷', '66' => '未知',];

    private static $power = [
        '0' => '≤3',
        '1' => '4',
        '2' => '5',
        '3' => '6',
        '4' => '7',
        '5' => '8',
        '6' => '9',
        '7' => '10',
        '8' => '11',
        '9' => '12'
    ];

    private static $wind = [
        '0' => '无风向',
        '1' => '东北',
        '2' => '东',
        '3' => '东南',
        '4' => '南',
        '5' => '西南',
        '6' => '西',
        '7' => '西北',
        '8' => '北',
        '9' => '旋转不定'
    ];

    /**
     * 获取天气状况
     *
     * @param string $key
     * @return string
     */
    static public function getWeather(string $key): string
    {
        return self::$weather[$key];
    }

    /**
     * 获取风力
     *
     * @param string $key
     * @return string
     */
    static public function getPower(string $key): string
    {
        return self::$power[$key];
    }

    /**
     * 获取风向
     *
     * @param string $key
     * @return string
     */
    static public function getWind(string $key): string
    {
        return self::$wind[$key];
    }
}